MOOC_blog/app/views/courses/index.html.erb

SELECT `courses`.* FROM `courses`
---
<h1>Top Courses</h1><br />
<% @course.each{|k| puts k.course_title}%>

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
          <td><p  style="font-size : 24px;"><%= image_tag course.image ,:size=>"70x70" %></p></td>
          <td><p  style="font-size : 24px;"><%= raw(User.find(course.user_id).name) %></p></td>