MOOC_blog/app/controllers/comments_controller.rb

   def create
      @user_id = current_user.id
#    @lecture = Lecture.find(params[:lecture_id])
     @comment = Comment.new(comment_params)
      respond_to do |format|
         if @comment.save
---
INSERT INTO `comments` (`user_id`, `comment_title`, `body`, `created_at`, `updated_at`) VALUES (5, 'mohamed comment', 'PLC IS VERY USFLE', '2016-05-04 17:40:51', '2016-05-04 17:40:51')

    def set_comment

       @comment = Comment.find(params[:id])
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1