MOOC_blog/app/controllers/courses_controller.rb

SELECT `courses`.* FROM `courses`
---
   def index
      @course = Course.all

INSERT INTO `courses` (`course_title`, `created_at`, `updated_at`) VALUES ('<p>PLC</p>\r\n', '2016-05-01 20:31:48', '2016-05-01 20:31:48')
---
   def create
      @course = Course.new(course_params)
      respond_to do |format|
         if @course.save

SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 6 LIMIT 1
---
   def set_course
      @course = Course.find(params[:id])