MOOC_blog/app/controllers/lectures_controller.rb

SELECT `lectures`.* FROM `lectures`  ORDER BY `lectures`.`cached_votes_up` DESC
---
  def index
    @lectures = Lecture.all.order(:cached_votes_up => 'desc')

SELECT `comments`.* FROM `comments` WHERE `comments`.`lecture_id` = 1
---
  def show
    @comments = @lecture.comments.all

INSERT INTO `lectures` (`title`, `content`, `created_at`, `updated_at`) VALUES ('', '', '2016-05-02 13:53:59', '2016-05-02 13:53:59')
---
  def create
    @lecture = Lecture.new(lecture_params)

    respond_to do |format|
      if @lecture.save

DELETE FROM `lectures` WHERE `lectures`.`id` = 1
---
  def destroy
    @lecture.destroy

UPDATE `lectures` SET `content` = '<p>hello there</p>\r\n', `updated_at` = '2016-05-02 21:42:46' WHERE `lectures`.`id` = 2
---
  def update
    respond_to do |format|
      if @lecture.update(lecture_params)

SELECT  `lectures`.* FROM `lectures` WHERE `lectures`.`id` = 2 LIMIT 1
---
  def set_lecture
    @lecture = Lecture.find(params[:id])