MOOC_blog/app/controllers/lectures_controller.rb

SELECT `lectures`.* FROM `lectures`  ORDER BY `lectures`.`created_at` ASC
---
  def index

    @lectures = Lecture.all.order(:created_at => 'asc')